result/20220702-160746_35c243ad4c242eea9945e44b16bfeea39ce0543c/benchmark/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        35241 bytes

Concurrency Level:      1
Time taken for tests:   30.963 seconds
Complete requests:      18
Failed requests:        0
Total transferred:      641034 bytes
HTML transferred:       634338 bytes
Requests per second:    0.58 [#/sec] (mean)
Time per request:       1720.150 [ms] (mean)
Time per request:       1720.150 [ms] (mean, across all concurrent requests)
Transfer rate:          20.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  1698 1720  58.7   1704    1950
Waiting:     1698 1720  58.7   1704    1950
Total:       1699 1720  58.7   1704    1950

Percentage of the requests served within a certain time (ms)
  50%   1704
  66%   1705
  75%   1706
  80%   1708
  90%   1754
  95%   1950
  98%   1950
  99%   1950
 100%   1950 (longest request)